Autodesk.Revit.DB.PlanarFace.YVector
The Y-vector of the planar face.
Remarks: Note that the cross product of X-vector and Y-vector may result in the reverse of the FaceNormal vector
depending upon how Revit has structured this particular face.

Autodesk.Revit.DB.PlanarFace.XVector
The X-vector of the planar face.
Remarks: Note that the cross product of X-vector and Y-vector may result in the reverse of the FaceNormal vector
depending upon how Revit has structured this particular face.

Autodesk.Revit.DB.PlanarFace.FaceNormal
Normal of the planar face.
Remarks: This property is the "face normal" vector, and thus should return a vector consistently pointing out of
the solid that this face is a boundary for (if it is a part of a solid).

Autodesk.Revit.DB.PlanarFace.Origin
Origin of the surface.

Autodesk.Revit.DB.PlanarFace
A bounded face of a 3d solid or open shell.
Remarks: Planar faces are defined by planes bounded by edge loops.
The planes provide natural UV parameterization to the faces.
S(u, v) = Origin + u*Vector[0] + v*Vector[1]